---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistn2
source: html/fb7b35f2-1e69-7d49-f992-723f3b06ce2e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistn2 Property

"Use Curve Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridUseCurveDistn2 { get; }
```